Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional (Bidirectional multiple                  135680    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
bidirectional_1 (Bidirection multiple                  98816     
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
bidirectional_2 (Bidirection multiple                  98816     
_________________________________________________________________
dropout_2 (Dropout)          multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  129       
=================================================================
Total params: 333,441
Trainable params: 333,441
Non-trainable params: 0
_________________________________________________________________
